--
-- PostgreSQL database dump
--

\restrict 4wuWkwgCcJgOxHRhSSUVDkNmn9ULSPmR9PnuXYED8aenwsGpKHJg3zajytxUkxi

-- Dumped from database version 17.6 (Ubuntu 17.6-1build1)
-- Dumped by pg_dump version 17.6 (Ubuntu 17.6-1build1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: users; Type: TABLE; Schema: public; Owner: finance_main
--

CREATE TABLE public.users (
    user_id integer NOT NULL,
    user_name text NOT NULL,
    user_id_tg bigint NOT NULL,
    currency text,
    categories text,
    fst_msg_status integer
);


ALTER TABLE public.users OWNER TO finance_main;

--
-- Name: users_data; Type: TABLE; Schema: public; Owner: finance_main
--

CREATE TABLE public.users_data (
    id integer NOT NULL,
    user_id integer,
    operation character(1),
    sum numeric(12,2),
    category text,
    date_add timestamp without time zone,
    CONSTRAINT users_data_operation_check CHECK ((operation = ANY (ARRAY['+'::bpchar, '-'::bpchar])))
);


ALTER TABLE public.users_data OWNER TO finance_main;

--
-- Name: users_data_id_seq; Type: SEQUENCE; Schema: public; Owner: finance_main
--

CREATE SEQUENCE public.users_data_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.users_data_id_seq OWNER TO finance_main;

--
-- Name: users_data_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: finance_main
--

ALTER SEQUENCE public.users_data_id_seq OWNED BY public.users_data.id;


--
-- Name: users_user_id_seq; Type: SEQUENCE; Schema: public; Owner: finance_main
--

CREATE SEQUENCE public.users_user_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.users_user_id_seq OWNER TO finance_main;

--
-- Name: users_user_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: finance_main
--

ALTER SEQUENCE public.users_user_id_seq OWNED BY public.users.user_id;


--
-- Name: users user_id; Type: DEFAULT; Schema: public; Owner: finance_main
--

ALTER TABLE ONLY public.users ALTER COLUMN user_id SET DEFAULT nextval('public.users_user_id_seq'::regclass);


--
-- Name: users_data id; Type: DEFAULT; Schema: public; Owner: finance_main
--

ALTER TABLE ONLY public.users_data ALTER COLUMN id SET DEFAULT nextval('public.users_data_id_seq'::regclass);


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: finance_main
--

COPY public.users (user_id, user_name, user_id_tg, currency, categories, fst_msg_status) FROM stdin;
1	dipperok	410981657	₽	Продукты, Развлечения, Транспорт, Подписки, Здоровье, Покупки	1
\.


--
-- Data for Name: users_data; Type: TABLE DATA; Schema: public; Owner: finance_main
--

COPY public.users_data (id, user_id, operation, sum, category, date_add) FROM stdin;
1	1	-	884.00	Транспорт	2025-06-03 20:20:18
2	1	-	1212.00	Продукты	2025-06-04 06:02:58
3	1	-	675.00	Продукты	2025-06-04 06:08:01
4	1	-	500.00	Подписки	2025-06-04 06:08:33
5	1	-	897.00	Продукты	2025-06-04 06:10:03
6	1	-	502.00	Покупки	2025-06-04 06:10:39
7	1	-	5000.00	Подписки	2025-06-04 06:11:05
8	1	-	167.00	Продукты	2025-06-04 06:11:22
10	1	-	420.00	Продукты	2025-06-04 09:39:55
11	1	-	117.00	Продукты	2025-06-04 14:54:23
12	1	-	358.00	Продукты	2025-06-05 06:11:07
13	1	+	97725.00	Доход	2025-06-05 07:28:54
14	1	-	535.00	Продукты	2025-06-05 09:12:23
15	1	+	15914.00	Доход	2025-06-06 03:57:28
16	1	+	461.00	Доход	2025-06-06 06:40:30
17	1	-	420.00	Продукты	2025-06-06 09:31:53
23	1	-	6589.00	Продукты	2025-06-06 12:00:51
24	1	-	4800.00	Развлечения	2025-06-06 12:55:41
25	1	-	234.00	Продукты	2025-06-06 14:50:07
26	1	-	10000.00	Подписки	2025-06-06 18:01:47
27	1	-	800.00	Продукты	2025-06-06 18:02:01
28	1	-	514.00	Продукты	2025-06-07 07:37:56
29	1	-	418.00	Продукты	2025-06-07 09:29:01
31	1	-	234.00	Развлечения	2025-06-07 12:46:45
32	1	-	400.00	Транспорт	2025-06-07 12:52:27
33	1	-	10000.00	Подписки	2025-06-07 13:06:32
37	1	-	808.00	Транспорт	2025-06-07 22:43:00
38	1	-	275.00	Продукты	2025-06-09 06:46:33
40	1	-	385.00	Продукты	2025-06-09 17:11:02
41	1	-	500.00	Подписки	2025-06-09 17:11:11
42	1	-	68.00	Продукты	2025-06-10 06:34:01
43	1	-	428.00	Продукты	2025-06-10 06:34:23
44	1	-	509.00	Продукты	2025-06-10 11:18:49
45	1	-	112.00	Продукты	2025-06-10 16:07:52
46	1	-	424.00	Развлечения	2025-06-10 16:35:54
47	1	-	1457.00	Продукты	2025-06-11 14:36:28
48	1	-	600.00	Продукты	2025-06-11 19:43:43
49	1	-	3800.00	Покупки	2025-06-13 08:40:28
50	1	-	2000.00	Транспорт	2025-06-13 08:40:49
51	1	-	2960.00	Продукты	2025-06-13 08:41:56
52	1	-	1020.00	Развлечения	2025-06-13 08:42:02
53	1	-	100.00	Подписки	2025-06-14 19:00:55
54	1	-	17000.00	Покупки	2025-06-14 19:01:18
55	1	-	400.00	Покупки	2025-06-14 19:46:25
56	1	-	600.00	Покупки	2025-06-15 13:02:04
57	1	-	563.00	Продукты	2025-06-16 11:38:20
58	1	-	414.00	Продукты	2025-06-18 09:21:35
59	1	-	57.00	Продукты	2025-06-18 09:22:36
60	1	-	323.00	Продукты	2025-06-18 09:22:44
61	1	-	135.00	Продукты	2025-06-18 09:22:54
62	1	-	316.00	Продукты	2025-06-18 09:23:16
63	1	-	110.00	Продукты	2025-06-18 10:10:52
64	1	-	421.00	Продукты	2025-06-19 08:54:38
65	1	-	450.00	Продукты	2025-06-19 10:19:32
66	1	+	45767.00	Доход	2025-06-20 07:36:33
67	1	-	270.00	Продукты	2025-06-20 10:08:07
68	1	-	524.00	Продукты	2025-06-20 10:08:25
69	1	-	1500.00	Продукты	2025-06-20 17:28:34
70	1	-	3250.00	Развлечения	2025-06-20 17:28:49
71	1	-	843.00	Продукты	2025-06-21 08:19:02
72	1	-	750.00	Продукты	2025-06-22 16:54:29
73	1	-	550.00	Продукты	2025-06-22 16:54:39
74	1	-	108.00	Транспорт	2025-06-22 18:34:37
75	1	-	471.00	Продукты	2025-06-24 05:29:09
76	1	-	237.00	Продукты	2025-06-24 05:29:16
77	1	-	57.00	Продукты	2025-06-24 05:29:28
78	1	-	238.00	Продукты	2025-06-24 06:32:24
79	1	-	108.00	Продукты	2025-06-24 14:55:38
80	1	-	700.00	Подписки	2025-06-24 14:55:44
81	1	-	518.00	Продукты	2025-06-24 16:10:25
82	1	-	1773.00	Продукты	2025-06-26 13:33:40
83	1	+	5500.00	Доход	2025-06-26 13:34:17
84	1	-	7150.00	Здоровье	2025-06-26 20:10:35
85	1	-	388.00	Продукты	2025-06-27 06:09:57
86	1	-	500.00	Продукты	2025-06-28 07:09:39
87	1	-	170.00	Продукты	2025-06-28 12:04:00
88	1	-	55000.00	Покупки	2025-06-30 04:52:31
89	1	-	2570.00	Продукты	2025-06-30 04:52:54
90	1	-	430.00	Продукты	2025-06-30 11:38:10
91	1	-	400.00	Продукты	2025-07-01 06:26:30
92	1	-	350.00	Продукты	2025-07-01 09:15:24
93	1	-	2150.00	Транспорт	2025-07-01 09:16:22
94	1	-	65.00	Продукты	2025-07-01 12:49:49
95	1	-	600.00	Транспорт	2025-07-01 16:36:20
96	1	-	200.00	Развлечения	2025-07-01 16:36:30
97	1	-	500.00	Продукты	2025-07-01 17:48:43
98	1	-	283.00	Продукты	2025-07-02 09:47:43
99	1	-	485.00	Продукты	2025-07-02 09:47:51
100	1	-	114.00	Продукты	2025-07-03 08:02:19
101	1	-	273.00	Продукты	2025-07-03 08:21:17
102	1	-	375.00	Продукты	2025-07-03 09:17:51
103	1	-	283.00	Продукты	2025-07-04 07:03:23
104	1	-	829.00	Развлечения	2025-07-04 07:03:32
105	1	+	95617.00	Доход	2025-07-04 07:03:42
106	1	+	13527.00	Доход	2025-07-04 12:09:16
107	1	-	395.00	Продукты	2025-07-04 12:09:32
108	1	-	554.00	Продукты	2025-07-05 17:02:06
109	1	-	1576.00	Развлечения	2025-07-05 17:02:24
110	1	-	1000.00	Продукты	2025-07-06 08:07:13
111	1	-	879.00	Развлечения	2025-07-06 20:34:38
112	1	-	240.00	Транспорт	2025-07-06 20:34:53
113	1	-	678.00	Продукты	2025-07-07 14:36:19
114	1	-	868.00	Продукты	2025-07-08 13:44:58
115	1	-	414.00	Продукты	2025-07-09 19:17:40
116	1	-	293.00	Продукты	2025-07-09 19:17:55
117	1	-	187.00	Продукты	2025-07-09 19:18:04
118	1	-	85.00	Продукты	2025-07-09 19:18:14
119	1	-	670.00	Продукты	2025-07-09 19:18:24
120	1	-	57.00	Продукты	2025-07-10 09:18:54
121	1	-	260.00	Продукты	2025-07-10 09:19:25
122	1	-	395.00	Продукты	2025-07-11 14:06:32
123	1	-	260.00	Продукты	2025-07-11 14:06:42
124	1	-	68.00	Продукты	2025-07-11 14:06:59
125	1	-	424.00	Развлечения	2025-07-11 16:09:16
126	1	-	1580.00	Здоровье	2025-07-11 17:04:58
127	1	-	455.00	Продукты	2025-07-11 17:05:38
128	1	-	15700.00	Подписки	2025-07-12 05:05:52
129	1	-	476.00	Продукты	2025-07-12 10:00:25
130	1	-	121.00	Продукты	2025-07-12 10:00:31
131	1	-	1800.00	Подписки	2025-07-13 09:48:36
132	1	-	919.00	Продукты	2025-07-15 05:56:46
133	1	-	420.00	Продукты	2025-07-15 15:08:15
134	1	-	18.00	Развлечения	2025-07-15 15:08:36
135	1	-	290.00	Продукты	2025-07-16 08:10:13
136	1	-	288.00	Продукты	2025-07-17 09:32:13
137	1	-	500.00	Подписки	2025-07-17 09:35:03
138	1	-	424.00	Продукты	2025-07-17 12:34:59
139	1	-	2540.00	Развлечения	2025-07-17 20:44:30
140	1	-	147.00	Продукты	2025-07-18 05:57:41
141	1	-	283.00	Продукты	2025-07-18 07:17:44
142	1	+	50790.00	Доход	2025-07-18 07:17:56
143	1	-	90.00	Продукты	2025-07-18 13:17:53
144	1	-	756.00	Продукты	2025-07-18 21:15:47
145	1	-	420.00	Продукты	2025-07-18 21:16:04
146	1	-	555.00	Продукты	2025-07-19 08:39:28
147	1	-	1380.00	Продукты	2025-07-19 10:07:46
148	1	-	418.00	Развлечения	2025-07-20 17:36:01
149	1	-	283.00	Продукты	2025-07-21 06:21:23
150	1	-	57.00	Продукты	2025-07-21 06:21:32
151	1	-	259.00	Развлечения	2025-07-21 08:12:58
152	1	-	179.00	Развлечения	2025-07-21 08:17:00
153	1	-	500.00	Подписки	2025-07-21 09:15:07
154	1	-	370.00	Продукты	2025-07-21 20:42:27
155	1	-	700.00	Подписки	2025-07-22 05:27:28
156	1	-	829.00	Развлечения	2025-07-22 07:53:05
157	1	-	75.00	Продукты	2025-07-22 12:03:33
158	1	-	273.00	Продукты	2025-07-22 12:03:47
159	1	-	238.00	Продукты	2025-07-23 07:32:59
160	1	-	774.00	Продукты	2025-07-23 07:33:37
161	1	-	7576.00	Развлечения	2025-07-23 07:40:28
162	1	-	486.00	Продукты	2025-07-23 09:47:17
163	1	-	57.00	Продукты	2025-07-24 06:01:20
164	1	-	615.00	Продукты	2025-07-24 09:46:00
165	1	-	293.00	Продукты	2025-07-24 09:46:13
166	1	-	250.00	Развлечения	2025-07-24 11:23:38
167	1	-	358.00	Продукты	2025-07-25 06:19:08
168	1	-	465.00	Продукты	2025-07-25 14:24:46
169	1	-	531.00	Продукты	2025-07-26 06:56:52
170	1	-	2139.00	Развлечения	2025-07-26 14:46:36
171	1	-	7150.00	Здоровье	2025-07-26 20:28:44
172	1	-	1630.00	Покупки	2025-07-26 20:29:18
173	1	-	283.00	Продукты	2025-07-28 06:42:05
174	1	-	560.00	Продукты	2025-07-28 09:45:20
175	1	-	70.00	Транспорт	2025-07-29 05:10:45
176	1	-	21000.00	Покупки	2025-07-30 20:59:02
177	1	-	700.00	Транспорт	2025-07-30 20:59:27
178	1	-	2401.00	Продукты	2025-07-30 21:00:18
179	1	-	1150.00	Развлечения	2025-07-30 21:00:52
180	1	-	323.00	Продукты	2025-08-01 06:24:09
181	1	-	295.00	Подписки	2025-08-01 06:24:46
182	1	-	238.00	Продукты	2025-08-01 06:24:58
183	1	-	500.00	Подписки	2025-08-01 06:25:07
184	1	-	419.00	Продукты	2025-08-01 06:25:27
185	1	-	57.00	Продукты	2025-08-01 06:25:34
186	1	-	169.00	Продукты	2025-08-01 06:25:55
187	1	-	408.00	Продукты	2025-08-01 09:40:12
188	1	-	720.00	Продукты	2025-08-02 06:54:16
189	1	-	860.00	Продукты	2025-08-02 11:07:57
190	1	-	10350.00	Покупки	2025-08-03 07:48:49
191	1	-	806.00	Продукты	2025-08-03 07:49:20
192	1	-	1210.00	Развлечения	2025-08-03 07:49:34
193	1	-	424.00	Развлечения	2025-08-04 04:45:47
194	1	-	2000.00	Транспорт	2025-08-04 05:10:54
195	1	-	313.00	Продукты	2025-08-04 06:27:26
196	1	-	685.00	Продукты	2025-08-04 13:09:48
197	1	-	189.00	Продукты	2025-08-04 18:17:28
198	1	+	141127.00	Доход	2025-08-05 08:06:51
199	1	-	403.00	Продукты	2025-08-05 11:40:57
200	1	-	1276.00	Подписки	2025-08-05 15:30:02
201	1	-	283.00	Продукты	2025-08-06 07:39:15
202	1	-	1400.00	Развлечения	2025-08-06 09:32:13
203	1	-	469.00	Продукты	2025-08-06 10:31:12
204	1	-	285.00	Продукты	2025-08-07 12:43:18
205	1	-	188.00	Продукты	2025-08-07 12:43:26
206	1	-	175.00	Продукты	2025-08-07 12:43:39
207	1	-	840.00	Продукты	2025-08-07 16:12:32
208	1	-	333.00	Продукты	2025-08-08 06:34:09
209	1	-	666.00	Продукты	2025-08-09 06:39:49
210	1	-	193.00	Продукты	2025-08-09 06:40:06
211	1	-	228.00	Продукты	2025-08-09 06:44:46
212	1	-	1500.00	Развлечения	2025-08-09 12:49:27
213	1	-	3900.00	Покупки	2025-08-10 09:28:45
214	1	-	624.00	Развлечения	2025-08-10 13:16:20
215	1	-	250.00	Развлечения	2025-08-11 06:00:22
216	1	-	2250.00	Развлечения	2025-08-11 06:00:30
217	1	-	273.00	Продукты	2025-08-11 06:25:07
218	1	-	2000.00	Развлечения	2025-08-11 12:30:27
219	1	-	313.00	Продукты	2025-08-12 06:17:11
220	1	-	407.00	Продукты	2025-08-12 11:37:53
221	1	-	85.00	Продукты	2025-08-12 13:38:25
222	1	-	1143.00	Продукты	2025-08-14 04:16:56
223	1	-	68.00	Продукты	2025-08-14 05:57:59
224	1	-	185.00	Продукты	2025-08-14 09:44:42
225	1	-	308.00	Продукты	2025-08-14 09:45:02
226	1	-	500.00	Продукты	2025-08-14 17:32:43
227	1	-	1990.00	Развлечения	2025-08-14 18:28:30
228	1	-	293.00	Продукты	2025-08-15 06:19:05
229	1	-	6000.00	Покупки	2025-08-15 11:11:27
230	1	-	373.00	Продукты	2025-08-15 11:11:42
231	1	-	17400.00	Покупки	2025-08-15 15:20:18
232	1	-	2873.00	Развлечения	2025-08-16 13:30:35
233	1	-	78.00	Транспорт	2025-08-16 16:18:53
234	1	-	250.00	Продукты	2025-08-16 16:19:14
235	1	-	137.00	Продукты	2025-08-16 16:19:37
236	1	-	168.00	Продукты	2025-08-16 16:20:09
237	1	-	127.00	Продукты	2025-08-16 16:20:27
238	1	-	75.00	Транспорт	2025-08-16 16:20:33
239	1	-	73.00	Транспорт	2025-08-16 19:00:04
240	1	-	2000.00	Транспорт	2025-08-16 19:01:03
241	1	-	301.00	Покупки	2025-08-16 22:34:35
242	1	-	495.00	Покупки	2025-08-17 20:45:28
243	1	-	660.00	Продукты	2025-08-18 11:01:07
244	1	-	379.00	Продукты	2025-08-18 11:01:20
245	1	-	573.00	Продукты	2025-08-18 11:01:40
246	1	-	3705.00	Покупки	2025-08-19 05:08:00
247	1	-	700.00	Подписки	2025-08-19 06:17:20
248	1	-	50.00	Покупки	2025-08-19 08:23:27
249	1	-	278.00	Продукты	2025-08-19 08:23:37
250	1	-	434.00	Продукты	2025-08-19 11:58:47
251	1	-	700.00	Покупки	2025-08-19 16:16:31
252	1	-	1828.00	Продукты	2025-08-21 20:56:49
253	1	-	829.00	Развлечения	2025-08-21 20:56:54
254	1	+	50791.00	Доход	2025-08-21 20:57:08
255	1	-	303.00	Продукты	2025-08-22 06:46:14
256	1	-	952.00	Здоровье	2025-08-22 12:44:11
257	1	+	17496.00	Доход	2025-08-22 12:44:41
258	1	-	58.00	Продукты	2025-08-22 12:44:48
259	1	-	395.00	Продукты	2025-08-22 12:45:06
260	1	-	4000.00	Развлечения	2025-08-22 19:44:21
261	1	-	8929.00	Развлечения	2025-08-23 18:53:31
262	1	-	243.00	Транспорт	2025-08-23 18:54:20
263	1	-	81.00	Транспорт	2025-08-23 18:54:26
264	1	-	1018.00	Продукты	2025-08-23 18:55:15
265	1	-	417.00	Транспорт	2025-08-23 18:55:23
266	1	-	283.00	Транспорт	2025-08-23 18:55:31
267	1	-	1100.00	Развлечения	2025-08-24 12:56:34
268	1	-	2500.00	Развлечения	2025-08-24 12:57:02
269	1	-	1729.00	Развлечения	2025-08-24 12:57:50
270	1	-	2160.00	Продукты	2025-08-24 15:15:48
271	1	-	7150.00	Здоровье	2025-08-24 15:16:06
272	1	-	5530.00	Покупки	2025-08-24 20:09:04
273	1	-	1421.00	Покупки	2025-08-25 13:10:24
274	1	-	320.00	Покупки	2025-08-25 15:20:37
275	1	-	474.00	Продукты	2025-08-26 11:29:41
276	1	-	400.00	Покупки	2025-08-26 12:59:27
277	1	-	1002.00	Продукты	2025-08-26 13:01:46
278	1	-	603.00	Продукты	2025-08-28 10:41:54
279	1	-	1300.00	Продукты	2025-08-28 17:12:21
280	1	-	368.00	Продукты	2025-08-29 06:14:14
281	1	-	595.00	Продукты	2025-08-29 11:14:39
282	1	-	559.00	Продукты	2025-08-29 15:08:22
283	1	-	607.00	Продукты	2025-08-30 12:38:13
284	1	-	207.00	Продукты	2025-08-30 12:38:24
285	1	-	8310.00	Покупки	2025-09-01 05:52:27
286	1	-	5000.00	Подписки	2025-09-01 05:52:39
287	1	-	283.00	Продукты	2025-09-01 06:57:03
288	1	-	250.00	Продукты	2025-09-01 06:57:09
289	1	-	395.00	Продукты	2025-09-01 10:54:41
290	1	-	1351.00	Покупки	2025-09-01 10:55:18
291	1	-	169.00	Продукты	2025-09-01 13:56:07
292	1	-	3620.00	Покупки	2025-09-01 19:38:32
293	1	-	283.00	Продукты	2025-09-02 06:48:01
294	1	-	258.00	Продукты	2025-09-02 08:41:51
295	1	-	1129.00	Продукты	2025-09-03 13:39:50
296	1	-	450.00	Покупки	2025-09-03 21:08:34
297	1	-	3610.00	Покупки	2025-09-04 05:23:40
298	1	-	74.00	Продукты	2025-09-04 06:08:30
299	1	-	408.00	Продукты	2025-09-04 07:37:07
300	1	-	400.00	Продукты	2025-09-04 09:25:13
301	1	-	107.00	Продукты	2025-09-04 10:07:25
302	1	-	400.00	Подписки	2025-09-05 06:04:19
303	1	-	333.00	Продукты	2025-09-05 06:20:20
304	1	-	900.00	Продукты	2025-09-05 06:42:36
305	1	+	214.00	Доход	2025-09-05 06:43:07
306	1	-	1.00	Продукты	2025-09-05 06:43:52
307	1	+	98320.00	Доход	2025-09-05 06:44:01
308	1	-	295390.00	Покупки	2025-09-05 06:53:20
309	1	-	320.00	Продукты	2025-09-05 10:20:37
310	1	+	14129.00	Доход	2025-09-05 11:45:31
311	1	-	2672.00	Продукты	2025-09-07 17:52:16
312	1	-	432.00	Продукты	2025-09-07 20:59:19
313	1	-	348.00	Продукты	2025-09-08 08:06:06
314	1	-	1323.00	Продукты	2025-09-08 18:36:08
315	1	-	783.00	Продукты	2025-09-09 06:47:10
316	1	-	427.00	Продукты	2025-09-09 09:27:03
317	1	-	169.00	Продукты	2025-09-09 12:30:35
318	1	-	424.00	Развлечения	2025-09-09 13:50:24
319	1	-	2000.00	Транспорт	2025-09-09 17:51:52
320	1	-	169.00	Продукты	2025-09-09 17:51:57
321	1	-	1124.00	Развлечения	2025-09-09 21:11:08
322	1	-	333.00	Продукты	2025-09-11 07:48:05
323	1	-	357.00	Продукты	2025-09-11 09:59:37
324	1	-	453.00	Продукты	2025-09-12 15:27:25
325	1	-	683.00	Продукты	2025-09-12 15:28:48
326	1	-	120.00	Продукты	2025-09-13 09:08:11
327	1	-	5000.00	Подписки	2025-09-13 11:44:06
328	1	-	1400.00	Продукты	2025-09-13 15:52:30
329	1	-	323.00	Развлечения	2025-09-14 12:01:26
330	1	-	600.00	Развлечения	2025-09-14 13:11:34
331	1	-	124.00	Транспорт	2025-09-14 16:09:21
332	1	-	1346.00	Транспорт	2025-09-14 16:09:59
333	1	-	122.00	Транспорт	2025-09-14 16:38:26
334	1	-	438.00	Продукты	2025-09-15 08:01:38
335	1	-	315.00	Продукты	2025-09-15 18:26:54
336	1	-	285.00	Продукты	2025-09-15 18:27:40
337	1	-	425.00	Продукты	2025-09-15 18:27:50
338	1	-	303.00	Продукты	2025-09-16 06:28:20
339	1	-	300.00	Продукты	2025-09-16 06:31:26
340	1	-	400.00	Продукты	2025-09-16 09:55:07
341	1	-	58.00	Продукты	2025-09-16 10:01:34
342	1	+	11817.00	Доход	2025-09-16 10:54:59
343	1	-	150.00	Продукты	2025-09-17 05:05:19
344	1	-	728.00	Продукты	2025-09-17 10:28:03
345	1	-	500.00	Подписки	2025-09-17 10:36:48
346	1	-	114.00	Продукты	2025-09-17 14:42:25
347	1	-	89.00	Продукты	2025-09-18 09:26:05
348	1	-	4550.00	Продукты	2025-09-18 13:23:24
349	1	-	700.00	Подписки	2025-09-19 06:17:25
350	1	-	263.00	Продукты	2025-09-19 07:12:30
351	1	+	46173.00	Доход	2025-09-19 07:59:41
352	1	-	550.00	Покупки	2025-09-19 14:28:09
353	1	-	172.00	Транспорт	2025-09-20 05:14:17
354	1	-	7442.00	Покупки	2025-09-20 05:14:46
355	1	-	32901.00	Покупки	2025-09-21 08:50:18
356	1	-	1800.00	Подписки	2025-09-21 08:50:28
357	1	-	190.00	Продукты	2025-09-21 08:50:37
358	1	-	424.00	Развлечения	2025-09-21 09:27:38
359	1	-	7150.00	Здоровье	2025-09-21 10:56:22
360	1	-	1500.00	Развлечения	2025-09-21 11:31:22
361	1	-	1607.00	Развлечения	2025-09-21 14:42:37
362	1	-	3800.00	Здоровье	2025-09-21 17:59:55
364	1	-	338.00	Продукты	2025-09-24 06:32:12
365	1	-	265.00	Покупки	2025-09-24 08:05:07
366	1	-	323.00	Продукты	2025-09-24 08:05:17
367	1	-	400.00	Продукты	2025-09-24 09:22:04
368	1	-	259.00	Продукты	2025-09-24 15:35:55
369	1	-	219.00	Продукты	2025-09-24 15:36:03
370	1	-	435.00	Продукты	2025-09-25 07:57:00
371	1	-	440.00	Продукты	2025-09-25 09:10:56
372	1	-	114.00	Продукты	2025-09-25 10:35:49
373	1	-	2930.00	Развлечения	2025-09-25 19:34:38
374	1	-	1900.00	Продукты	2025-09-28 09:28:46
375	1	-	1000.00	Развлечения	2025-09-28 09:29:01
376	1	-	118.00	Продукты	2025-09-28 09:29:20
377	1	-	679.00	Развлечения	2025-09-28 09:29:34
378	1	-	1033.00	Развлечения	2025-09-28 09:30:23
379	1	-	695.00	Развлечения	2025-09-28 09:30:57
380	1	-	172.00	Продукты	2025-09-28 16:32:00
381	1	-	376.00	Продукты	2025-09-29 06:43:37
382	1	-	455.00	Продукты	2025-09-29 09:51:45
383	1	-	1.00	Продукты	2025-09-29 11:58:48
384	1	+	5862.00	Доход	2025-09-29 11:58:56
385	1	-	134.00	Покупки	2025-09-29 12:47:57
386	1	-	135.00	Продукты	2025-09-29 14:05:58
387	1	-	438.00	Продукты	2025-09-30 07:14:09
388	1	-	395.00	Продукты	2025-09-30 16:00:46
389	1	-	105.00	Продукты	2025-09-30 16:00:54
390	1	-	1200.00	Покупки	2025-09-30 18:02:27
391	1	-	228.00	Продукты	2025-10-01 07:01:47
392	1	-	3000.00	Развлечения	2025-10-01 18:00:28
393	1	-	368.00	Продукты	2025-10-03 12:21:29
394	1	-	453.00	Продукты	2025-10-03 12:21:37
395	1	+	16005.00	Доход	2025-10-03 12:21:46
397	1	+	108710.00	Доход	2025-10-03 12:23:14
398	1	-	3678.00	Развлечения	2025-10-04 12:05:45
399	1	-	10000.00	Подписки	2025-10-04 12:08:34
400	1	-	558.00	Продукты	2025-10-05 18:41:32
401	1	-	1235.00	Продукты	2025-10-07 06:38:17
402	1	-	259.00	Продукты	2025-10-07 15:40:27
403	1	-	356.00	Продукты	2025-10-07 17:25:32
404	1	-	516.00	Продукты	2025-10-07 17:25:58
405	1	-	338.00	Продукты	2025-10-08 06:38:56
406	1	-	253.00	Продукты	2025-10-08 06:39:08
407	1	-	156.00	Продукты	2025-10-08 13:09:50
408	1	-	526.00	Продукты	2025-10-08 13:10:15
409	1	-	2000.00	Транспорт	2025-10-09 09:04:38
410	1	-	255.00	Продукты	2025-10-09 09:04:46
411	1	-	2210.00	Покупки	2025-10-09 10:00:55
412	1	-	1024.00	Продукты	2025-10-09 13:56:09
413	1	-	126.00	Продукты	2025-10-09 13:56:13
414	1	-	1107.00	Покупки	2025-10-10 04:49:02
415	1	-	370.00	Продукты	2025-10-10 11:47:15
416	1	-	235.00	Продукты	2025-10-10 11:47:25
418	1	-	734.00	Покупки	2025-10-10 12:34:12
419	1	-	540.00	Покупки	2025-10-10 12:38:45
420	1	-	350.00	Покупки	2025-10-10 12:38:50
421	1	-	191.00	Продукты	2025-10-11 11:02:53
422	1	-	30.00	Покупки	2025-10-11 16:11:54
423	1	-	170.00	Продукты	2025-10-11 17:36:37
424	1	-	508.00	Продукты	2025-10-11 18:39:15
425	1	-	1183.00	Транспорт	2025-10-11 23:13:01
426	1	-	1706.00	Продукты	2025-10-12 13:11:40
427	1	-	230.00	Развлечения	2025-10-12 13:25:00
428	1	-	361.00	Продукты	2025-10-13 07:01:31
429	1	+	1901.00	Доход	2025-10-13 07:10:02
430	1	-	302.00	Продукты	2025-10-13 09:46:01
431	1	-	184.00	Продукты	2025-10-13 15:02:05
432	1	-	263.00	Продукты	2025-10-14 09:14:41
433	1	-	333.00	Продукты	2025-10-14 09:14:46
434	1	-	420.00	Продукты	2025-10-14 10:55:26
435	1	-	3172.00	Покупки	2025-10-14 17:11:22
436	1	-	5000.00	Подписки	2025-10-14 17:11:30
437	1	-	761.00	Покупки	2025-10-14 17:42:42
438	1	-	150.00	Продукты	2025-10-15 14:22:44
439	1	-	415.00	Продукты	2025-10-15 14:22:55
440	1	-	220.00	Продукты	2025-10-15 14:23:02
441	1	-	1230.00	Продукты	2025-10-16 19:27:25
442	1	-	198.00	Продукты	2025-10-16 19:27:41
443	1	+	19945.00	Доход	2025-10-16 19:27:58
444	1	+	339.00	Доход	2025-10-16 19:28:03
445	1	-	643.00	Продукты	2025-10-17 09:45:25
446	1	-	1737.00	Продукты	2025-10-21 15:43:09
447	1	-	700.00	Подписки	2025-10-21 15:45:31
448	1	-	2565.00	Развлечения	2025-10-21 15:45:42
449	1	-	8000.00	Подписки	2025-10-21 15:45:50
450	1	-	12678.00	Продукты	2025-10-21 15:46:13
451	1	+	50138.00	Доход	2025-10-21 15:47:03
452	1	-	688.00	Продукты	2025-10-22 13:32:24
453	1	-	500.00	Подписки	2025-10-22 13:32:30
454	1	-	846.00	Продукты	2025-10-23 14:48:47
455	1	-	608.00	Продукты	2025-10-24 10:02:30
456	1	-	450.00	Продукты	2025-10-24 10:03:22
457	1	-	78.00	Продукты	2025-10-24 19:24:04
458	1	-	958.00	Развлечения	2025-10-24 19:24:21
459	1	-	2087.00	Продукты	2025-10-26 08:31:46
460	1	-	1800.00	Покупки	2025-10-26 08:31:50
461	1	+	10.00	Доход	2025-10-27 19:19:14.870539
462	1	-	10.00	Продукты	2025-10-27 19:19:20.033153
\.


--
-- Name: users_data_id_seq; Type: SEQUENCE SET; Schema: public; Owner: finance_main
--

SELECT pg_catalog.setval('public.users_data_id_seq', 462, true);


--
-- Name: users_user_id_seq; Type: SEQUENCE SET; Schema: public; Owner: finance_main
--

SELECT pg_catalog.setval('public.users_user_id_seq', 1, false);


--
-- Name: users_data users_data_pkey; Type: CONSTRAINT; Schema: public; Owner: finance_main
--

ALTER TABLE ONLY public.users_data
    ADD CONSTRAINT users_data_pkey PRIMARY KEY (id);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: finance_main
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (user_id);


--
-- Name: users_data users_data_user_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: finance_main
--

ALTER TABLE ONLY public.users_data
    ADD CONSTRAINT users_data_user_id_fkey FOREIGN KEY (user_id) REFERENCES public.users(user_id) ON DELETE CASCADE;


--
-- Name: SCHEMA public; Type: ACL; Schema: -; Owner: pg_database_owner
--

GRANT ALL ON SCHEMA public TO finance_main;


--
-- Name: DEFAULT PRIVILEGES FOR TABLES; Type: DEFAULT ACL; Schema: public; Owner: postgres
--

ALTER DEFAULT PRIVILEGES FOR ROLE postgres IN SCHEMA public GRANT ALL ON TABLES TO finance_main;


--
-- PostgreSQL database dump complete
--

\unrestrict 4wuWkwgCcJgOxHRhSSUVDkNmn9ULSPmR9PnuXYED8aenwsGpKHJg3zajytxUkxi

